GR_MATH0025/notes0.org
#+TITLE: Overall Notes for General Relativity 


* Week 1
** Vector that lives on the sheet
 
$f: V \to R$

- Parameterization that forces vector to live inside a curved surface
  - Recall from Newtonian mechanics
- a bunch of stuff I have to go through again 
  - Covariant and contravariant vectors
    - Derivation
  - Coordinate transformation

* Week 2
** Tensors
Tensor of type (p,q) is: $T^{i_1,i_2,...,i_p}_{j_1,j_2,...,j_q}$
*** Tensors have upper and lower indices:
- Upper indices transform contravariantly
- Lower indices transform covariantly
*** Ranks
- Scalar: 0
- Vectors: 1
- We will not go beyond rank 4 tensors in this course
*** Contraction
- Summing over a pair of indices results in a tensor of rank = p+q-2
- Proof requires showing that the a set of Jacobian cancels out
- This forms a kronecker delta, which does not change transformation
- QED
*** Partial Derivatives
- Not a tensor
- Transformation properties of PD
- Rewriting it as a chain rule and product rule
- One term obeys tensor trans. but the other does not
*** Manifolds
- An n dimensional, smooth (inf. diff.) is a set
- with collection of open subsets ${\omega_\alpha}$
- a collection of coordinates ${X^i_{(\alpha)}}$
- Where $\alpha \in N$ and $i = 1,2,...,n$
  - every point on the manifold belongs to at least one ${\Omega_\alpha}
- EXAMPLE: Surface of Earth is a manifold
- Collection are pages of atlas
- Overlap
*** Distance
- $g_{ij}$ is a rank 2 tensor known as metric tensor
- Represents distance
- Inverse: $g^{jk}$
- The line element: $ds^2 = g_{ij}dX^idX^j
  - Where $g_{ij}$ are arbitrary function of coordinates
  - If it is I, then it becomes $ds^2 = dx^2+dy^2+dz^2$
Remark:
| Dimensions | Independent components |
|------------+------------------------|
|         2D |                      3 |
|         3D |                      6 |
|         4D |                     10 |
|        N-D |     $\frac{N(N+1)}{2}$ |
- Other motivation for the metric structure:
To introduce a mapping that links the covariant and the contravariant
*** Metric Signature
- Counts the number of positive and negative eigenvalues
- Kronecker delta: (/+,/+,+)
- GR: (-,/+,+,+)
- Line elements or metric in GR are called Lorentzian manifolds
*** Geodesic Equation
- Def: A curve $C$ given by $X^i(\lambda)$ is *geodesic*
- if it satisfies $\ddot{X}^n+\Gamma^{n}_{ms}\dot{X}^m\dot{X}^s = 0$
Where $\Gamma^n_{ms} = \frac12 g^{nk}\left(\partial_m g_{sk} + \partial_s g_{km} - \partial_k g_{ms}\right)$
- Geodesics are shortest distances between points
- Get metric tensors and you can computed
- *Christoffel Symbol*: $\Gamma^n_{ms}$
- Derive from E-L and learn the actual derivations, watch it a few times
** Summary:
* Week 3
*** Geodesic Equation in Polar Coordinates
- Solutions are given by straight lines (Exercise is to show this)
*** The Christoffel symbol can be found in two ways
    - Explicit formula
    - via Lagrangian approach
*** Simplified/reduced Lagragian gives the same EL equations
    - However one is used over the other
    - Because sqrt is motivated from arc 
*** Metric tensor 
    - $g_{ij}T^iT^j = ||T||^2$
    - Can be used to raise or lower indices (see Zee)
    - Upper is column, lower is row
      1) $T_i^j = g_{is}T^{sj}$
      2) $T_j^i = g_{js}T^{is}$
      3) $T_{ij} = g_{im}g_{jn}T^{mn}$
*** Covariant Derivative
    - A covariant derivative $\nabla_a$ on a mapping
    - From tensors of type (p,q) to tensors type (p,q+1)
    - Has the following properties:
      1. If f is a smooth function, then $\nabla_{a}f=\partial_{a}f$
      2. $\nabla_a$ is linear (like Operators)
      3. Leibniz (product) rule
      4. Commutes with contraction
	 - Contract first then differentiate or vice versa
*** Metricity 
    - Something is metric compatitable if:
    - $\nabla_a g_{bc} = 0$
    - Else, the non-metricity is $Q_abc =  \nabla_a g_{bc} = 0$
*** Torsion
    - Torsion is defined by:
    - $(\nabla_a\nabla_b f - \nabla_b \nabla)a f) = T_{ab}^c\partial_{cf}$
    - GR assumes $T_{ab}^c=0$
*** Fine $\nabla_a A^i$
    - $\partial_a A^i$ is not a rank 2 tensor
    - $\partial_a f = \nabla_a A^i$
    - Thus $\partial_a A^i$ should be linear in $A^i$
    - Something about showing a C from the equation of this function
*** Christoffel symbol components
    - The C are actually the Christoffel symbol
      - Show that it is symmetric
      - Torsion free
      - Examinable proof of writing out the three equations
	- Adding up and subtracting
*** Parallel Transport
    - In GR, the straightest curves are shortest
    - However, in presence of torsion, this is no longer the case

* Week 4

*** Curvature
    - Introducing it with parallel transport
    - Walk from equator, northpole then back to equator
      - The change of vector when parallelly transported
      - Along a closed curve
      - Defines the curvature
    - Introducing it with Calculus
    - Curvature of a curve matches closely with a circle
    - curvature = 1/r ish
*** Riemann Curvature Tensor
    - Let M be a manifold
    - With covariant der. $\nabla_a$ (metric and torsion free).
    - $\nabla_a\nabla_d V^b - \nabla_d \nabla_a V^b = -R_{ads}^b V^s$
    - Defines the Riemann curvature tensor
    - (Short: Riemann tensor)
*** Theorem:
    - $F_{ij} = \nabla_i A_j - \nabla_j A_i$
    - Satisfies the identity:
    - $\nabla_iF_{jk} + \nabla_k F_{ij} + \nabla_j F_{ki} = 0$
    - Proof:
      - Write out the covariant derivative of the F tensors
      - Add up the three terms/lines
      - skew symmetric tensors (negative of flip)
*** Theorem: Let $R_{abcd}$ be the Riemann curvature Tensor:
    1. R_{abcd} = -R_{bacd}
    2. R_{abcd} = -R_{abdc}
    3. R_{abcd} + R_{cabd} + R_{bcad} = 0
       * We are only permuting the first 3 indices
    4. \nabla_{a}R_{bcde}+\nabla_{c}R_{abde}+\nabla_{b}R_{cade} = 0
       * This is called the Bianchi identity


*** Ricci tensor and Riemann Tensor
