GR_MATH0025/notes0.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-04-21 Thu 17:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Overall Notes for General Relativity</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Kelvin" />
</head>
<body>
<div id="content">
<h1 class="title">Overall Notes for General Relativity</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9699ae1">1. Week 1</a>
<ul>
<li><a href="#org3322c2f">1.1. Vector that lives on the sheet</a></li>
</ul>
</li>
<li><a href="#orgf65c5b7">2. Week 2</a>
<ul>
<li><a href="#orga81652d">2.1. Tensors</a>
<ul>
<li><a href="#org932a961">2.1.1. Tensors have upper and lower indices:</a></li>
<li><a href="#org72e459a">2.1.2. Ranks</a></li>
<li><a href="#org6c00703">2.1.3. Contraction</a></li>
<li><a href="#org2703e14">2.1.4. Partial Derivatives</a></li>
<li><a href="#org039b739">2.1.5. Manifolds</a></li>
<li><a href="#orgfb5f0c7">2.1.6. Distance</a></li>
<li><a href="#org108be9d">2.1.7. Metric Signature</a></li>
<li><a href="#org28ee993">2.1.8. Geodesic Equation</a></li>
</ul>
</li>
<li><a href="#org77e1a25">2.2. Summary:</a></li>
</ul>
</li>
<li><a href="#orgddbc5f6">3. Week 3</a>
<ul>
<li>
<ul>
<li><a href="#orge905b12">3.0.1. Geodesic Equation in Polar Coordinates</a></li>
<li><a href="#orgea23210">3.0.2. The Christoffel symbol can be found in two ways</a></li>
<li><a href="#org758007f">3.0.3. Simplified/reduced Lagragian gives the same EL equations</a></li>
<li><a href="#org9b128f9">3.0.4. Metric tensor</a></li>
<li><a href="#org88005f0">3.0.5. Covariant Derivative</a></li>
<li><a href="#orgd44b8dd">3.0.6. Metricity</a></li>
<li><a href="#orgc689fa4">3.0.7. Torsion</a></li>
<li><a href="#org620b2db">3.0.8. Fine \(\nabla_a A^i\)</a></li>
<li><a href="#orge80dcda">3.0.9. Christoffel symbol components</a></li>
<li><a href="#orgf8d1a43">3.0.10. Parallel Transport</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org91c6c0e">4. Week 4</a>
<ul>
<li>
<ul>
<li><a href="#org5311779">4.0.1. Curvature</a></li>
<li><a href="#orgfbdc447">4.0.2. Riemann Curvature Tensor</a></li>
<li><a href="#orgea25c02">4.0.3. Theorem:</a></li>
<li><a href="#org73b0ded">4.0.4. Theorem: Let \(R_{abcd}\) be the Riemann curvature Tensor:</a></li>
<li><a href="#org4ca40d3">4.0.5. Ricci tensor and Riemann Tensor</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org9699ae1" class="outline-2">
<h2 id="org9699ae1"><span class="section-number-2">1</span> Week 1</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org3322c2f" class="outline-3">
<h3 id="org3322c2f"><span class="section-number-3">1.1</span> Vector that lives on the sheet</h3>
<div class="outline-text-3" id="text-1-1">
<p>
\(f: V \to R\)
</p>

<ul class="org-ul">
<li>Parameterization that forces vector to live inside a curved surface
<ul class="org-ul">
<li>Recall from Newtonian mechanics</li>
</ul></li>
<li>a bunch of stuff I have to go through again 
<ul class="org-ul">
<li>Covariant and contravariant vectors
<ul class="org-ul">
<li>Derivation</li>
</ul></li>
<li>Coordinate transformation</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgf65c5b7" class="outline-2">
<h2 id="orgf65c5b7"><span class="section-number-2">2</span> Week 2</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orga81652d" class="outline-3">
<h3 id="orga81652d"><span class="section-number-3">2.1</span> Tensors</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Tensor of type (p,q) is: \(T^{i_1,i_2,...,i_p}_{j_1,j_2,...,j_q}\)
</p>
</div>
<div id="outline-container-org932a961" class="outline-4">
<h4 id="org932a961"><span class="section-number-4">2.1.1</span> Tensors have upper and lower indices:</h4>
<div class="outline-text-4" id="text-2-1-1">
<ul class="org-ul">
<li>Upper indices transform contravariantly</li>
<li>Lower indices transform covariantly</li>
</ul>
</div>
</div>
<div id="outline-container-org72e459a" class="outline-4">
<h4 id="org72e459a"><span class="section-number-4">2.1.2</span> Ranks</h4>
<div class="outline-text-4" id="text-2-1-2">
<ul class="org-ul">
<li>Scalar: 0</li>
<li>Vectors: 1</li>
<li>We will not go beyond rank 4 tensors in this course</li>
</ul>
</div>
</div>
<div id="outline-container-org6c00703" class="outline-4">
<h4 id="org6c00703"><span class="section-number-4">2.1.3</span> Contraction</h4>
<div class="outline-text-4" id="text-2-1-3">
<ul class="org-ul">
<li>Summing over a pair of indices results in a tensor of rank = p+q-2</li>
<li>Proof requires showing that the a set of Jacobian cancels out</li>
<li>This forms a kronecker delta, which does not change transformation</li>
<li>QED</li>
</ul>
</div>
</div>
<div id="outline-container-org2703e14" class="outline-4">
<h4 id="org2703e14"><span class="section-number-4">2.1.4</span> Partial Derivatives</h4>
<div class="outline-text-4" id="text-2-1-4">
<ul class="org-ul">
<li>Not a tensor</li>
<li>Transformation properties of PD</li>
<li>Rewriting it as a chain rule and product rule</li>
<li>One term obeys tensor trans. but the other does not</li>
</ul>
</div>
</div>
<div id="outline-container-org039b739" class="outline-4">
<h4 id="org039b739"><span class="section-number-4">2.1.5</span> Manifolds</h4>
<div class="outline-text-4" id="text-2-1-5">
<ul class="org-ul">
<li>An n dimensional, smooth (inf. diff.) is a set</li>
<li>with collection of open subsets \({\omega_\alpha}\)</li>
<li>a collection of coordinates \({X^i_{(\alpha)}}\)</li>
<li>Where \(\alpha \in N\) and \(i = 1,2,...,n\)
<ul class="org-ul">
<li>every point on the manifold belongs to at least one ${&Omega;<sub>&alpha;</sub>}</li>
</ul></li>
<li>EXAMPLE: Surface of Earth is a manifold</li>
<li>Collection are pages of atlas</li>
<li>Overlap</li>
</ul>
</div>
</div>
<div id="outline-container-orgfb5f0c7" class="outline-4">
<h4 id="orgfb5f0c7"><span class="section-number-4">2.1.6</span> Distance</h4>
<div class="outline-text-4" id="text-2-1-6">
<ul class="org-ul">
<li>\(g_{ij}\) is a rank 2 tensor known as metric tensor</li>
<li>Represents distance</li>
<li>Inverse: \(g^{jk}\)</li>
<li>The line element: $ds<sup>2</sup> = g<sub>ij</sub>dX<sup>idX</sup><sup>j</sup>
<ul class="org-ul">
<li>Where \(g_{ij}\) are arbitrary function of coordinates</li>
<li>If it is I, then it becomes \(ds^2 = dx^2+dy^2+dz^2\)</li>
</ul></li>
</ul>
<p>
Remark:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Dimensions</th>
<th scope="col" class="org-right">Independent components</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">2D</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-right">3D</td>
<td class="org-right">6</td>
</tr>

<tr>
<td class="org-right">4D</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-right">N-D</td>
<td class="org-right">\(\frac{N(N+1)}{2}\)</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>Other motivation for the metric structure:</li>
</ul>
<p>
To introduce a mapping that links the covariant and the contravariant
</p>
</div>
</div>
<div id="outline-container-org108be9d" class="outline-4">
<h4 id="org108be9d"><span class="section-number-4">2.1.7</span> Metric Signature</h4>
<div class="outline-text-4" id="text-2-1-7">
<ul class="org-ul">
<li>Counts the number of positive and negative eigenvalues</li>
<li>Kronecker delta: (/+,/+,+)</li>
<li>GR: (-,/+,+,+)</li>
<li>Line elements or metric in GR are called Lorentzian manifolds</li>
</ul>
</div>
</div>
<div id="outline-container-org28ee993" class="outline-4">
<h4 id="org28ee993"><span class="section-number-4">2.1.8</span> Geodesic Equation</h4>
<div class="outline-text-4" id="text-2-1-8">
<ul class="org-ul">
<li>Def: A curve \(C\) given by \(X^i(\lambda)\) is <b>geodesic</b></li>
<li>if it satisfies \(\ddot{X}^n+\Gamma^{n}_{ms}\dot{X}^m\dot{X}^s = 0\)</li>
</ul>
<p>
Where \(\Gamma^n_{ms} = \frac12 g^{nk}\left(\partial_m g_{sk} + \partial_s g_{km} - \partial_k g_{ms}\right)\)
</p>
<ul class="org-ul">
<li>Geodesics are shortest distances between points</li>
<li>Get metric tensors and you can computed</li>
<li><b>Christoffel Symbol</b>: \(\Gamma^n_{ms}\)</li>
<li>Derive from E-L and learn the actual derivations, watch it a few times</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org77e1a25" class="outline-3">
<h3 id="org77e1a25"><span class="section-number-3">2.2</span> Summary:</h3>
</div>
</div>
<div id="outline-container-orgddbc5f6" class="outline-2">
<h2 id="orgddbc5f6"><span class="section-number-2">3</span> Week 3</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orge905b12" class="outline-4">
<h4 id="orge905b12"><span class="section-number-4">3.0.1</span> Geodesic Equation in Polar Coordinates</h4>
<div class="outline-text-4" id="text-3-0-1">
<ul class="org-ul">
<li>Solutions are given by straight lines (Exercise is to show this)</li>
</ul>
</div>
</div>
<div id="outline-container-orgea23210" class="outline-4">
<h4 id="orgea23210"><span class="section-number-4">3.0.2</span> The Christoffel symbol can be found in two ways</h4>
<div class="outline-text-4" id="text-3-0-2">
<ul class="org-ul">
<li>Explicit formula</li>
<li>via Lagrangian approach</li>
</ul>
</div>
</div>
<div id="outline-container-org758007f" class="outline-4">
<h4 id="org758007f"><span class="section-number-4">3.0.3</span> Simplified/reduced Lagragian gives the same EL equations</h4>
<div class="outline-text-4" id="text-3-0-3">
<ul class="org-ul">
<li>However one is used over the other</li>
<li>Because sqrt is motivated from arc</li>
</ul>
</div>
</div>
<div id="outline-container-org9b128f9" class="outline-4">
<h4 id="org9b128f9"><span class="section-number-4">3.0.4</span> Metric tensor</h4>
<div class="outline-text-4" id="text-3-0-4">
<ul class="org-ul">
<li>\(g_{ij}T^iT^j = ||T||^2\)</li>
<li>Can be used to raise or lower indices (see Zee)</li>
<li>Upper is column, lower is row
<ol class="org-ol">
<li>\(T_i^j = g_{is}T^{sj}\)</li>
<li>\(T_j^i = g_{js}T^{is}\)</li>
<li>\(T_{ij} = g_{im}g_{jn}T^{mn}\)</li>
</ol></li>
</ul>
</div>
</div>
<div id="outline-container-org88005f0" class="outline-4">
<h4 id="org88005f0"><span class="section-number-4">3.0.5</span> Covariant Derivative</h4>
<div class="outline-text-4" id="text-3-0-5">
<ul class="org-ul">
<li>A covariant derivative \(\nabla_a\) on a mapping</li>
<li>From tensors of type (p,q) to tensors type (p,q+1)</li>
<li>Has the following properties:
<ol class="org-ol">
<li>If f is a smooth function, then \(\nabla_{a}f=\partial_{a}f\)</li>
<li>\(\nabla_a\) is linear (like Operators)</li>
<li>Leibniz (product) rule</li>
<li>Commutes with contraction
<ul class="org-ul">
<li>Contract first then differentiate or vice versa</li>
</ul></li>
</ol></li>
</ul>
</div>
</div>
<div id="outline-container-orgd44b8dd" class="outline-4">
<h4 id="orgd44b8dd"><span class="section-number-4">3.0.6</span> Metricity</h4>
<div class="outline-text-4" id="text-3-0-6">
<ul class="org-ul">
<li>Something is metric compatitable if:</li>
<li>\(\nabla_a g_{bc} = 0\)</li>
<li>Else, the non-metricity is \(Q_abc =  \nabla_a g_{bc} = 0\)</li>
</ul>
</div>
</div>
<div id="outline-container-orgc689fa4" class="outline-4">
<h4 id="orgc689fa4"><span class="section-number-4">3.0.7</span> Torsion</h4>
<div class="outline-text-4" id="text-3-0-7">
<ul class="org-ul">
<li>Torsion is defined by:</li>
<li>\((\nabla_a\nabla_b f - \nabla_b \nabla)a f) = T_{ab}^c\partial_{cf}\)</li>
<li>GR assumes \(T_{ab}^c=0\)</li>
</ul>
</div>
</div>
<div id="outline-container-org620b2db" class="outline-4">
<h4 id="org620b2db"><span class="section-number-4">3.0.8</span> Fine \(\nabla_a A^i\)</h4>
<div class="outline-text-4" id="text-3-0-8">
<ul class="org-ul">
<li>\(\partial_a A^i\) is not a rank 2 tensor</li>
<li>\(\partial_a f = \nabla_a A^i\)</li>
<li>Thus \(\partial_a A^i\) should be linear in \(A^i\)</li>
<li>Something about showing a C from the equation of this function</li>
</ul>
</div>
</div>
<div id="outline-container-orge80dcda" class="outline-4">
<h4 id="orge80dcda"><span class="section-number-4">3.0.9</span> Christoffel symbol components</h4>
<div class="outline-text-4" id="text-3-0-9">
<ul class="org-ul">
<li>The C are actually the Christoffel symbol
<ul class="org-ul">
<li>Show that it is symmetric</li>
<li>Torsion free</li>
<li>Examinable proof of writing out the three equations
<ul class="org-ul">
<li>Adding up and subtracting</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgf8d1a43" class="outline-4">
<h4 id="orgf8d1a43"><span class="section-number-4">3.0.10</span> Parallel Transport</h4>
<div class="outline-text-4" id="text-3-0-10">
<ul class="org-ul">
<li>In GR, the straightest curves are shortest</li>
<li>However, in presence of torsion, this is no longer the case</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org91c6c0e" class="outline-2">
<h2 id="org91c6c0e"><span class="section-number-2">4</span> Week 4</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org5311779" class="outline-4">
<h4 id="org5311779"><span class="section-number-4">4.0.1</span> Curvature</h4>
<div class="outline-text-4" id="text-4-0-1">
<ul class="org-ul">
<li>Introducing it with parallel transport</li>
<li>Walk from equator, northpole then back to equator
<ul class="org-ul">
<li>The change of vector when parallelly transported</li>
<li>Along a closed curve</li>
<li>Defines the curvature</li>
</ul></li>
<li>Introducing it with Calculus</li>
<li>Curvature of a curve matches closely with a circle</li>
<li>curvature = 1/r ish</li>
</ul>
</div>
</div>
<div id="outline-container-orgfbdc447" class="outline-4">
<h4 id="orgfbdc447"><span class="section-number-4">4.0.2</span> Riemann Curvature Tensor</h4>
<div class="outline-text-4" id="text-4-0-2">
<ul class="org-ul">
<li>Let M be a manifold</li>
<li>With covariant der. \(\nabla_a\) (metric and torsion free).</li>
<li>\(\nabla_a\nabla_d V^b - \nabla_d \nabla_a V^b = -R_{ads}^b V^s\)</li>
<li>Defines the Riemann curvature tensor</li>
<li>(Short: Riemann tensor)</li>
</ul>
</div>
</div>
<div id="outline-container-orgea25c02" class="outline-4">
<h4 id="orgea25c02"><span class="section-number-4">4.0.3</span> Theorem:</h4>
<div class="outline-text-4" id="text-4-0-3">
<ul class="org-ul">
<li>\(F_{ij} = \nabla_i A_j - \nabla_j A_i\)</li>
<li>Satisfies the identity:</li>
<li>\(\nabla_iF_{jk} + \nabla_k F_{ij} + \nabla_j F_{ki} = 0\)</li>
<li>Proof:
<ul class="org-ul">
<li>Write out the covariant derivative of the F tensors</li>
<li>Add up the three terms/lines</li>
<li>skew symmetric tensors (negative of flip)</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org73b0ded" class="outline-4">
<h4 id="org73b0ded"><span class="section-number-4">4.0.4</span> Theorem: Let \(R_{abcd}\) be the Riemann curvature Tensor:</h4>
<div class="outline-text-4" id="text-4-0-4">
<ol class="org-ol">
<li>R<sub>abcd</sub> = -R<sub>bacd</sub></li>
<li>R<sub>abcd</sub> = -R<sub>abdc</sub></li>
<li>R<sub>abcd</sub> + R<sub>cabd</sub> + R<sub>bcad</sub> = 0
<ul class="org-ul">
<li>We are only permuting the first 3 indices</li>
</ul></li>
<li>&nabla;<sub>a</sub>R<sub>bcde</sub>+&nabla;<sub>c</sub>R<sub>abde</sub>+&nabla;<sub>b</sub>R<sub>cade</sub> = 0
<ul class="org-ul">
<li>This is called the Bianchi identity</li>
</ul></li>
</ol>
</div>
</div>


<div id="outline-container-org4ca40d3" class="outline-4">
<h4 id="org4ca40d3"><span class="section-number-4">4.0.5</span> Ricci tensor and Riemann Tensor</h4>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Kelvin</p>
<p class="date">Created: 2022-04-21 Thu 17:00</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
